tap "ankitpokhrel/jira-cli"
tap "azure/kubelogin"
tap "codefresh-io/cli"
tap "dopplerhq/cli"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "lotyp/formulae"
tap "matiaskorhonen/paper-age"
tap "ngrok/ngrok"
tap "norwoodj/tap"
tap "prospectone/perfops"
tap "teamookla/speedtest"
tap "upbound/tap"
tap "versent/taps"
tap "vmware-tanzu/carvel"
# Simple, modern, secure file encryption
brew "age"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Spell checker with better logic than ispell
brew "aspell"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Securely store and access AWS credentials in development environments
brew "aws-vault"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Official Amazon AWS command-line interface
brew "awscli"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Сoncurrent, cache-efficient, and Dockerfile-agnostic builder toolkit
brew "buildkit"
# Core application library for C
brew "glib"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Color-highlighted diff(1) output
brew "colordiff"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Securely send things from one computer to another
brew "croc"
# Open source suite of directory software
brew "openldap"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Tool to perform numerical, textual & statistical operations
brew "datamash"
# CLI tool to run policies against Kubernetes manifests YAML files or Helm charts
brew "datree"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# File comparison utilities
brew "diffutils"
# Tool for exploring each layer in a docker image
brew "dive"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Minify and secure Docker images
brew "docker-slim"
# OpenType text shaping engine
brew "harfbuzz"
# Multi-format archive and compression library
brew "libarchive"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Play, record, convert, and stream audio and video
brew "ffmpeg@4"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Command-line utility for uploading Gists
brew "gist"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# Git extension for versioning large files
brew "git-lfs"
# Alternative to top/htop
brew "glances"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU implementation of time utility
brew "gnu-time"
# GNU implementation of which utility
brew "gnu-which"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Google Search and News from the command-line
brew "googler"
# Terminal based graphical activity monitor inspired by gtop and vtop
brew "gotop"
# GNU grep, egrep and fgrep
brew "grep"
# Make JSON greppable
brew "gron"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Modular IRC client
brew "irssi"
# Istio configuration command-line utility
brew "istioctl"
# Json incremental digger
brew "jid"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Command-line note taker
brew "jrnl"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Tool to move from `docker-compose` to Kubernetes
brew "kompose"
# Package manager for kubectl plugins
brew "krew"
# Kubernetes prompt info for bash and zsh
brew "kube-ps1"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# LastPass command-line interface tool
brew "lastpass-cli"
# Sophisticated file transfer program
brew "lftp"
# Library to render SVG files using Cairo
brew "librsvg"
# Lynx-like WWW browser that supports tables, menus, etc.
brew "links"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# GUI for vim, made for macOS
brew "macvim"
# Securely transfers data between computers
brew "magic-wormhole"
# Mac App Store command-line interface
brew "mas"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Tools for one-time password authentication systems
brew "oath-toolkit"
# Kubernetes introspection tool for developers
brew "octant"
# OCI Registry As Storage
brew "oras"
# 🔐 Share end-to-end encrypted secrets with others via a one-time URL
brew "ots"
# Shell command parallelization utility
brew "parallel"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Password manager
brew "pass"
# Pass extension for managing one-time-password tokens
brew "pass-otp"
# Simplistic interactive filtering tool
brew "peco"
# Command-line player for https://pandora.com
brew "pianobar"
# Object-relational database system
brew "postgresql@14", restart_service: true
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Show ps output as a tree
brew "pstree"
# Monitor data's progress through a pipe
brew "pv"
# Password generator
brew "pwgen"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Alternative to pyenv for managing virtualenvs
brew "pyenv-virtualenvwrapper"
# File browser
brew "ranger"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Fast, efficient and secure backup program
brew "restic"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Text replacement utility
brew "rpl"
# Login and retrieve AWS temporary credentials using a SAML IDP
brew "saml2aws"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Terminal based presentation tool
brew "slides"
# SOcket CAT: netcat on steroids
brew "socat"
# Editor of encrypted files
brew "sops"
# Crypto and x509 Swiss-Army-Knife
brew "step"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# User interface to the TELNET protocol
brew "telnet"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# CLI tool to generate terraform files from existing infrastructure
brew "terraformer"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Linter for Terraform files
brew "tflint"
# Terragrunt version manager inspired by tfenv
brew "tgenv"
# Code-search similar to ack
brew "the_silver_searcher"
# Simplified and community-driven man pages
brew "tldr"
# Instant terminal sharing
brew "tmate"
# Terminal multiplexer
brew "tmux"
# Anonymizing overlay network for TCP
brew "tor"
# Command-line interface to the freedesktop.org trashcan
brew "trash-cli"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# URL extractor/launcher
brew "urlview"
# Creates fully functional virtual k8s cluster inside host k8s cluster's namespace
brew "vcluster"
# Disaster recovery for Kubernetes resources and persistent volumes
brew "velero"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Homebrew, but with Docker images
brew "whalebrew"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Tracks most-used directories to make cd smarter
brew "z"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Informative git prompt for zsh
brew "zsh-git-prompt"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Tips, tricks, and examples for zsh
brew "zsh-lovers"
# Zsh curses-based tools, e.g. multi-word history searcher
brew "zsh-navigation-tools"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# 🔥 Feature-rich interactive Jira command-line
brew "ankitpokhrel/jira-cli/jira-cli"
# A Kubernetes credential (exec) plugin implementing azure authentication
brew "azure/kubelogin/kubelogin"
# Codefresh CLI provides a full and flexible interface to interact with Codefresh.
brew "codefresh-io/cli/codefresh"
# The official Doppler CLI for managing your secrets
brew "dopplerhq/cli/doppler", link: false
# Tool for managing dock items.
brew "lotyp/formulae/dockutil"
# Easy and secure paper backups of secrets
brew "matiaskorhonen/paper-age/paper-age"
# Automatically generate markdown documentation for helm charts
brew "norwoodj/tap/helm-docs"
brew "prospectone/perfops/perfops"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# The official Upbound CLI
brew "upbound/tap/up"
# Ytt
brew "vmware-tanzu/carvel/ytt"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line helper for the 1Password password manager
cask "1password-cli1"
# GPU-accelerated terminal emulator
cask "alacritty"
# Two-factor authentication software
cask "authy"
# Managed client-based VPN service to securely access AWS resources
cask "aws-vpn-client"
# Decentralized bitcoin exchange network
cask "bisq"
# Utility to display the output from any script or program in the menu bar
cask "bitbar"
# Desktop password and login vault
cask "bitwarden"
# Web browser focusing on privacy
cask "brave-browser"
# Utility that prevents the system from going to sleep
cask "caffeine"
# Free app that makes your Internet safer
cask "cloudflare-warp"
# Multi-platform client-side cloud file encryption tool
cask "cryptomator"
# Voice and text chat software
cask "discord"
# Tool to hide status bar icons
cask "dozer"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Tools to protect your emails and files
cask "gpg-suite"
# Video and photo editor
cask "insta360-studio"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# End-to-end encryption software
cask "keybase"
# Free and open-source media player
cask "kodi"
# Animated screen capture application
cask "licecap"
# Clipboard manager
cask "maccy"
# File system integration
cask "macfuse"
# Explorer for Azure Storage
cask "microsoft-azure-storage-explorer"
# Open-source download manager
cask "motrix"
# Media player based on MPlayer and mplayer2
cask "mpv"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Utility to toggle dark mode
cask "nightowl"
# Calculator and converter application
cask "numi"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Open source build of Lens Kubernetes IDE
cask "openlens"
# Collaboration platform for API development
cask "postman"
# VPN client focusing on security
cask "protonvpn"
# Kubernetes and container management on the desktop
cask "rancher"
# Centralizes all remote connections on a single platform
cask "remote-desktop-manager"
# Binary authorization system
cask "santa"
# Instant messaging application focusing on security
cask "signal"
# Screen capture tool with mark up and sharing features
cask "skitch"
# Team communication and collaboration software
cask "slack"
# Messaging app with a focus on speed and security
cask "telegram"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Configurable document editor that supports Markdown
cask "typora"
# Development environment
cask "vagrant"
cask "vagrant-manager"
# Disk encryption software focusing on security based on TrueCrypt
cask "veracrypt"
# Calling and messaging application focusing on security
cask "viber"
# Menu bar application for ChatGPT
cask "vincelwt-chatgpt"
# Virtualizer for x86 and arm64 hardware
cask "virtualbox-beta"
# Multimedia player
cask "vlc"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# Rust-based terminal
cask "warp"
# Desktop client for WhatsApp
cask "whatsapp"
# Network protocol analyzer
cask "wireshark"
# Screen capture tool for remote teams
cask "zappy"
mas "DigiDoc4 Client", id: 1370791134
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Messenger", id: 1480068668
mas "miMind", id: 1385638089
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Tailscale", id: 1475387142
