aircrack-ng
android-sdk
aspell
auto-scaling
autoconf
automake
aws-iam-tools
bison
boot2docker
brew-cask
cairo
cloog-ppl015
cloud-watch
cmake
docker
eigen
faac
faad2
ffmpeg
fontconfig
fortune
freetype
gcc
gcc47
gdbm
gettext
glib
gmp
gmp4
gnupg
gnutls
gobject-introspection
gpg-agent
graphviz
ilmbase
imagemagick
irssi
isl
jpeg
jq
json-c
lame
libao
libassuan
libevent
libffi
libgcrypt
libgpg-error
libksba
libmpc
libmpc08
libpng
libtasn1
libtiff
libtool
libusbx
libvo-aacenc
libyaml
little-cms2
mad
makedepend
morse
mpfr
mpfr2
mysql
nettle
nmap
numpy
oniguruma
opencv
openexr
openjpeg
openssl
packer
parallel
pdf2json
pdfgrep
pianobar
pinentry
pixman
pkg-config
poppler
ppl011
pth
pwgen
python3
rbenv
rbenv-binstubs
readline
ruby
ruby-build
ruby20
sbt
showterm
sqlite
sshpass
swaks
texi2html
tmux
tree
vim
watch
wget
wxmac
x264
xvid
xz
yasm
